## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.vault_scan_object.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      ~ id      = "637310177" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault:log-stream:*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.vault_scan_object.aws_cloudwatch_log_metric_filter.scan_files_lambda_error[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_lambda_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/s3-scan-object-vault"
      + name           = "S3ScanObjectLambdaErrorVault"
      + pattern        = "ERROR"

      + metric_transformation {
          + name      = "S3ScanObjectLambdaErrorVault"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
      + alarm_description                     = "Errors logged by the Scan Files transport lambda function"
      + alarm_name                            = "S3ScanObjectLambdaErrorVault"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "S3ScanObjectLambdaErrorVault"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.vault_scan_object.aws_iam_policy.s3_scan_object will be updated in-place
  ~ resource "aws_iam_policy" "s3_scan_object" {
        id        = "arn:aws:iam::687401027353:policy/S3ScanObject-vault"
        name      = "S3ScanObject-vault"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault:log-stream:*",
                          - "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/s3-scan-object-vault",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.vault_scan_object.aws_lambda_function.s3_scan_object will be updated in-place
  ~ resource "aws_lambda_function" "s3_scan_object" {
        id                             = "s3-scan-object-vault"
      ~ last_modified                  = "2022-07-11T13:04:51.518+0000" -> (known after apply)
      ~ reserved_concurrent_executions = 3 -> 10
      ~ source_code_hash               = "H+LWBR73DEeblAitNF5EPT8Pi5KToRQJ/rlEwevztiY=" -> "u0Ad2XndCenFo6v19oRwENnhqgpRqMqQbymsu5QNIUY="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
